_author_ = ' Сумарокова Евгений Владимирович'
# Задача - 1 (while):
a = int( input( "Введите число - "))
while a>9:
      print(a%10)
      a = a//10
print(a)
 
